Revit 2027 API
AssetPropertyList.AddNewAssetPropertyInteger Method
 Adds a new AssetPropertyInteger containing the input value to this list.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddNewAssetPropertyInteger(
	int value
)
Public Sub AddNewAssetPropertyInteger (
	value As Integer
)
public:
void AddNewAssetPropertyInteger(
	int value
)
member AddNewAssetPropertyInteger :
        value : int -> unit
Parameters
value Int32
 The integer value to add.
Exceptions
Exception | Condition
InvalidOperationException |  The asset property is not editable.
See Also
Reference
AssetPropertyList Class
Autodesk.Revit.DB.Visual Namespace